[M_Sage_Mission02_CUT MissionDefinition]
MissionName="Promotion"
MissionDescription="He reached for Hunter's hammer, but to no avail. Hammerlock tells you to go to the nearest power station and turn on the power..<br>But before you do that, you need to refresh the water...you might need it later.."
TurnInDescription="To get the light! and conditioning in the medical industry."
MissionSummary="Drink more water."
MissionGiver="hammer"
MissionTurnInLocation="Origin of the first name Hammer Lock"
TeaserText=""

[M_Sage_Mission02_CUT:ActivateGenerator MissionObjectiveDefinition]
ProgressMessage=""

[M_Sage_Mission02_CUT:ActivateGeneratorSet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Sage_Mission02_CUT:ClearDebris1 MissionObjectiveDefinition]
ProgressMessage="Remove debris from southern equipment"

[M_Sage_Mission02_CUT:ClearDebris2 MissionObjectiveDefinition]
ProgressMessage="Check out the Avenida Ester section"

[M_Sage_Mission02_CUT:ClearDebris3 MissionObjectiveDefinition]
ProgressMessage="The top manager also clears things up"

[M_Sage_Mission02_CUT:ClearDebrisSet MissionObjectiveSetDefinition]
MissionSummaryOverride="The generator converts the power to the hammer lock chamber."
MissionDescriptionOverride="You arrive at Hammerlock's hunting ground, but he has no power Hammerlock wants to go to the nearby switchboard and turn on the light.<br>It looks like you're flipping a switch, but nothing happens Professor Nakayama says he stopped the pinion of the energy transfer generator to complete his secret mission. To direct the flow of power to the hammer fork, you have to open the crank."

[M_Sage_Mission02_CUT:DivertPowerSet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Sage_Mission02_CUT:EnableCoolingFan MissionObjectiveDefinition]
ProgressMessage="Turn on the fan."

[M_Sage_Mission02_CUT:EnableCoolingFanSet MissionObjectiveSetDefinition]
MissionSummaryOverride="Turn on the fan."
MissionDescriptionOverride="He got into the Hammer Hunt but was weak. Hammerlock requires you to go to the nearest power station and restore power..<br>Turn on the power and the generator piston spins but is hot. Hammerlock asks you not to turn your followers into a bunch of pickpockets.."

[M_Sage_Mission02_CUT:EnableCoolingFanSet2 MissionObjectiveSetDefinition]
MissionSummaryOverride="Turn on the fan."
MissionDescriptionOverride="He arrives at Hammerlock's hunting ground, but the fire goes out. Hammerlock asks you to go to a nearby power plant to restore power..<br>They ignited the generator piston but it was too hot. It takes a hammer to turn a fan, not stupid vault hunters.."

[M_Sage_Mission02_CUT:EnablePower MissionObjectiveDefinition]
ProgressMessage="Turn on the power"

[M_Sage_Mission02_CUT:EnablePowerSet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Sage_Mission02_CUT:FinalSet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Sage_Mission02_CUT:FindGenerator MissionObjectiveDefinition]
ProgressMessage="Find a generator"

[M_Sage_Mission02_CUT:FindGeneratorSet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Sage_Mission02_CUT:GetBuffDrink MissionObjectiveDefinition]
ProgressMessage="Buy a humidifier."

[M_Sage_Mission02_CUT:GotoPowerStation MissionObjectiveDefinition]
ProgressMessage="I am looking for an old power station"

[M_Sage_Mission02_CUT:GotoPowerStationSet MissionObjectiveSetDefinition]
MissionSummaryOverride="Go to Adodon Station and restore power to Hammerlock Hall.."
MissionDescriptionOverride="You've been to Hammerlock Castle, but it's not official. Hammerlock tells you to go to the nearest power station to restore your power.."

[M_Sage_Mission02_CUT:GrabBuffDrinkSet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Sage_Mission02_CUT:KillCreature MissionObjectiveDefinition]
ProgressMessage="killing animals"

[M_Sage_Mission02_CUT:KillCreatureSet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Sage_Mission02_CUT:KillEndBoss MissionObjectiveDefinition]
ProgressMessage="killing animals"

[M_Sage_Mission02_CUT:KillEndBossSet MissionObjectiveSetDefinition]
MissionSummaryOverride="Slay the beast that stands between you and your audience.."
MissionDescriptionOverride="You've arrived at Hammerlock's hunting grounds, but the power has gone. Hammerlock tells him to go to the nearest power plant and restart it..<br>He fired at the piston and the rotating piston, but everything was hot. You'd have to be a Hammerlock fan not to smile like a cache hunter..<br>As you climb higher, a larger creature approaches. You have to kill to get it."

[M_Sage_Mission02_CUT:Node1Set MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Sage_Mission02_CUT:Node2 MissionObjectiveDefinition]
ProgressMessage="Increase the capacity of other nodes"

[M_Sage_Mission02_CUT:Node2Set MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Sage_Mission02_CUT:Node3 MissionObjectiveDefinition]
ProgressMessage="Third session management."

[M_Sage_Mission02_CUT:Node3Set MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Sage_Mission02_CUT:Node4 MissionObjectiveDefinition]
ProgressMessage="Now insert the fourth node"

[M_Sage_Mission02_CUT:PowerLodge MissionObjectiveDefinition]
ProgressMessage="Wake up the candle"

[M_Sage_Mission02_CUT:PowerLodgeSet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Sage_Mission02_CUT:RepairSet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Sage_Mission02_CUT:ReturnHammerlock MissionObjectiveDefinition]
ProgressMessage="Back to Lord Hammerlock"

[M_Sage_Mission02_CUT:ReturnHammerlockSet MissionObjectiveSetDefinition]
MissionSummaryOverride="Return to the Hammer House and activate the power."
MissionDescriptionOverride="When you cross Arderton station the power will transfer to Hammerlock hunting station. Now he is back in power.."

